
# একটি সংখ্যার সব গুণনীয়ক (ভাজক) বের করতে হবে।

# ইনপুট:
# প্রথম লাইনে থাকবে টেস্ট কেসের সংখ্যা T (≤ 10)। পরবর্তী T-সংখ্যক লাইনে একটি করে পূর্ণসংখ্যা N থাকবে, যেখানে 1 ≤ N ≤ 100,000।

# আউটপুট:
# প্রতিটি কেসের জন্য একটি করে লাইন প্রিন্ট করতে হবে, শুরুতে কেস নম্বর দিতে হবে। এরপর N-এর সব গুণনীয়ক ছোটো থেকে বড়ো ক্রমানুসারে প্রিন্ট করতে হবে। প্রতিটি গুণনীয়ক শুধু একবার প্রিন্ট করতে হবে। গুণনীয়কগুলোকে শুধু একটি স্পেস দিয়ে আলাদা করতে হবে। লাইনের শেষে কোনো অতিরিক্ত স্পেস থাকবে না।

# নমুনা
# ইনপুট	আউটপুট
# 3       
# 5555  Case 1: 1 5 11 55 101 505 1111 5555
# 120   Case 2: 1 2 3 4 5 6 8 10 12 15 20 24 30 40 60 120
# 49    Case 3: 1 7 49


n = int(input())

for i in range(1,n+1):
    T = int(input())
    for k in range(1,T+1):
        if T % k == 0:

            print(k, end=' ')

