
# একটি পূর্ণসংখ্যা দেওয়া থাকবে, সেটি জোড় না বিজোড় তা বের করতে হবে।

# ইনপুট:
# প্রথম লাইনে একটি সংখ্যা T (1 ≤ T ≤ 100) দেওয়া থাকবে। পরবর্তীতে T-এর মান যত, ততটি লাইন থাকবে। প্রতিটি লাইনে একটি করে পূর্ণসংখ্যা N (0 ≤ N ≤ 2,147,483,647) দেওয়া থাকবে।

# আউটপুট:
# প্রতিটি পূর্ণসংখ্যার জন্য, সংখ্যাটি জোড় হলে even, আর বিজোড় হলে odd কথাটি প্রিন্ট করতে হবে।

# নমুনা:
# ইনপুট	    আউটপুট
# 3
# 0         even
# 5         odd
# 2222      even

# Solution

T = int(input())
    
for i in range(T):
    N = int(input())
    if N%2==0:
        print('even')
    else:
        print('odd')