# পাঁচ অঙ্কের একটি সংখ্যার প্রথম ও শেষ অঙ্কের যোগফল নির্ণয় করার প্রোগ্রাম লিখতে হবে।

# ইনপুট
# প্রোগ্রামটির প্রথম ইনপুট হবে একটি পূর্ণসংখ্যা T (1 ≤ T ≤ 10,000), যা মোট কয়টি পাঁচ অঙ্কের সংখ্যা ইনপুট নিতে হবে তা নির্দেশ করবে। পরবর্তী T-সংখ্যক লাইনে একটি করে পূর্ণসংখ্যা N (10,000 ≤ N ≤ 99,999) ইনপুট নিতে হবে।

# আউটপুট
# প্রোগ্রামটির আউটপুটে N-এর প্রথম ও শেষ অঙ্কের যোগফল প্রিন্ট করতে হবে নিচের নমুনা আউটপুটে যেভাবে দেখানো আছে ঠিক সেই ফরম্যাটে। প্রতিটি আউটপুটের পরে একটি নিউলাইন প্রিন্ট করতে হবে। আউটপুটে =-এর আগের ও পরের স্পেসটি লক্ষণীয়।

# নমুনা
# ইনপুট	    আউটপুট
# 5
# 98023     Sum = 12
# 45830     Sum = 4
# 76406     Sum = 13
# 15528     Sum = 9
# 30576     Sum = 9



T = int(input())

for i in range(T):
    N = int(input())
    res = [int(x) for x in str(N)]
    sum = res[0] + res[(len(res) - 1)]
    print(f'Sum = {sum}')
    
    